Documents/ТК_ГрафикИнвентаризаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_ГрафикИнвентаризаций</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТК_ГрафикиИнвентаризаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикТорговыхОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыИнвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСкладов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтборов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыПоУмолчанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСкладов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеОтборов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТК_ГрафикИнвентаризаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ПодразделениеКомпании)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом



#КонецОбласти




#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаГрафикиИнвентаризаций(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаВтТаблицаОтборы(Запрос,ТекстыЗапроса);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	ГрафикиСервер.ПодготовитьТаблицуДвижений(Запрос, ДополнительныеСвойства);
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаГрафикиИнвентаризаций(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ГрафикиИнвентаризаций";
	
	Если Не ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТК_ГрафикИнвентаризацийГрафикТорговыхОбъектов.Дата КАК Дата,
	               |	ТК_ГрафикИнвентаризацийГрафикТорговыхОбъектов.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ТК_ГрафикИнвентаризацийГрафикТорговыхОбъектов.Ключ КАК Ключ
	               |ИЗ
	               |	Документ.ТК_ГрафикИнвентаризаций.ГрафикТорговыхОбъектов КАК ТК_ГрафикИнвентаризацийГрафикТорговыхОбъектов
	               |ГДЕ
	               |	ТК_ГрафикИнвентаризацийГрафикТорговыхОбъектов.Ссылка = &Ссылка";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВтТаблицаОтборы(Запрос, ТекстыЗапроса)
	
	ИмяРегистра = "ТаблицаОтборы";
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	ТК_ГрафикИнвентаризацийОтборыИнвентаризации.ТорговаяПлощадка КАК ТорговаяПлощадка,
	              	|	ТК_ГрафикИнвентаризацийОтборыИнвентаризации.ТипСклада КАК ТипСклада,
	              	|	ТК_ГрафикИнвентаризацийОтборыИнвентаризации.ХранилищеОтборов КАК ХранилищеОтборов,
	              	|	ТК_ГрафикИнвентаризацийОтборыИнвентаризации.Ключ КАК Ключ,
	              	|	ВЫРАЗИТЬ(ТК_ГрафикИнвентаризацийОтборыИнвентаризации.Наименование КАК СТРОКА(150)) КАК Описание
	              	|ИЗ
	              	|	Документ.ТК_ГрафикИнвентаризаций.ОтборыИнвентаризации КАК ТК_ГрафикИнвентаризацийОтборыИнвентаризации
	              	|ГДЕ
	              	|	ТК_ГрафикИнвентаризацийОтборыИнвентаризации.Ссылка.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	ИмяРегистра = "ТаблицаОтборыПоУмолчанию";
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	ТК_ГрафикИнвентаризацийОтборыПоУмолчанию.ТипСклада КАК ТипСклада,
	              	|	ТК_ГрафикИнвентаризацийОтборыПоУмолчанию.ХранилищеОтборов КАК ХранилищеОтборов,
	              	|	ВЫРАЗИТЬ(ТК_ГрафикИнвентаризацийОтборыПоУмолчанию.Наименование КАК СТРОКА(150)) КАК Описание
	              	|ИЗ
	              	|	Документ.ТК_ГрафикИнвентаризаций.ОтборыПоУмолчанию КАК ТК_ГрафикИнвентаризацийОтборыПоУмолчанию
	              	|ГДЕ
	              	|	ТК_ГрафикИнвентаризацийОтборыПоУмолчанию.Ссылка.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	
	
	Возврат ТекстЗапроса;
	
КонецФункции



#КонецОбласти


// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Устанавливает параметры загрузки.
//
// Параметры:
//  Параметры - Структура - параметры загрузки данных из файла.
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
	ТипДанныхКолонки = Параметры.ТипДанныхКолонки;
	ТипДанныхКолонки.Вставить("Дата",Новый ОписаниеТипов("Строка",,	Новый КвалификаторыСтроки(25)));
	ТипДанныхКолонки.Вставить("ТорговаяПлощадка",Новый ОписаниеТипов("Строка",,	Новый КвалификаторыСтроки(150)));
	
	МассивОбзятельныхКолонок = Новый Массив;
	МассивОбзятельныхКолонок.Добавить("Дата");
	МассивОбзятельныхКолонок.Добавить("ТорговаяПлощадка");
	
	Параметры.ОбязательныеКолонки = МассивОбзятельныхКолонок;
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                               находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                               являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаГраФик = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ТаблицаГраФик.Колонки.Удалить("Ключ");
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ДанныеДляСопоставления.Код КАК СТРОКА(200)) КАК Код,
	               |	ВЫРАЗИТЬ(ДанныеДляСопоставления.Дата КАК СТРОКА(25)) КАК Дата,
	               |	ВЫРАЗИТЬ(ДанныеДляСопоставления.ТорговаяПлощадка КАК СТРОКА(100)) КАК ТорговаяПлощадка,
	               |	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	               |ПОМЕСТИТЬ ДанныеДляСопоставления
	               |ИЗ
	               |	&ДанныеДляСопоставления КАК ДанныеДляСопоставления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	спрТорговыеПлощадки.Ссылка КАК Ссылка,
	               |	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	               |ПОМЕСТИТЬ СопоставленнаяПоКоду
	               |ИЗ
	               |	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТорговыеПлощадки КАК спрТорговыеПлощадки
	               |		ПО ДанныеДляСопоставления.Код = спрТорговыеПлощадки.Код
	               |			И (ДанныеДляСопоставления.Код <> """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеДляСопоставления.ТорговаяПлощадка КАК ТорговаяПлощадка,
	               |	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	               |ПОМЕСТИТЬ ДанныеДляСопоставленияПоНаименованию
	               |ИЗ
	               |	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	               |ГДЕ
	               |	НЕ ДанныеДляСопоставления.Идентификатор В
	               |				(ВЫБРАТЬ
	               |					СопоставленнаяПоКоду.Идентификатор КАК Идентификатор
	               |				ИЗ
	               |					СопоставленнаяПоКоду КАК СопоставленнаяПоКоду)
	               |	И ДанныеДляСопоставления.ТорговаяПлощадка <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	спрТорговыеПлощадки.Ссылка КАК Ссылка,
	               |	ДанныеДляСопоставленияПоНаименованию.Идентификатор КАК Идентификатор
	               |ПОМЕСТИТЬ СопоставленнаяПоНаименованию
	               |ИЗ
	               |	ДанныеДляСопоставленияПоНаименованию КАК ДанныеДляСопоставленияПоНаименованию
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТорговыеПлощадки КАК спрТорговыеПлощадки
	               |		ПО ДанныеДляСопоставленияПоНаименованию.ТорговаяПлощадка = спрТорговыеПлощадки.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СопоставленнаяПоНаименованию.Идентификатор КАК Идентификатор,
	               |	МАКСИМУМ(СопоставленнаяПоНаименованию.Ссылка) КАК Ссылка,
	               |	""Наименование"" КАК ПолеПоиска,
	               |	КОЛИЧЕСТВО(СопоставленнаяПоНаименованию.Идентификатор) КАК Количество
	               |ИЗ
	               |	СопоставленнаяПоНаименованию КАК СопоставленнаяПоНаименованию
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СопоставленнаяПоНаименованию.Идентификатор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СопоставленнаяПоКоду.Идентификатор,
	               |	МАКСИМУМ(СопоставленнаяПоКоду.Ссылка),
	               |	""Код"",
	               |	КОЛИЧЕСТВО(СопоставленнаяПоКоду.Идентификатор)
	               |ИЗ
	               |	СопоставленнаяПоКоду КАК СопоставленнаяПоКоду
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СопоставленнаяПоКоду.Идентификатор";
	
	Запрос.УстановитьПараметр("ДанныеДляСопоставления", ЗагружаемыеДанные);
	
	ТаблицаНоменклатура = Запрос.Выполнить().Выгрузить();	
	ТаблицаНоменклатура.Индексы.Добавить("Идентификатор");
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл 
		График = ТаблицаГраФик.Добавить();
		
		График.Идентификатор = СтрокаТаблицы.Идентификатор;
		График.Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаТаблицы.Дата,ЧастиДаты.Дата);
	//	График.Ключ = Новый УникальныйИдентификатор();
		нСтрока = ТаблицаНоменклатура.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		Если нСтрока <> Неопределено Тогда 			
			Если нСтрока.Количество = 1 Тогда 
				
				График.ТорговаяПлощадка = нСтрока.Ссылка;			
				
			ИначеЕсли нСтрока.Количество > 1 Тогда 
				
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор;
				ЗаписьОНеоднозначности.Колонка = "Торговая площадка";
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	
	ПоместитьВоВременноеХранилище(ТаблицаГраФик, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//    ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//    ИмяКолонки               - Строка - Имя колонки, в который возникла неоднозначность. 
//    СписокНеоднозначностей    - Массив  - Массив для заполнения с неоднозначными данными.
//    ЗагружаемыеЗначенияСтрока - Строка  - Загружаемые данные, на основании которых возникла неоднозначность.
//    ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "Номенклатура" Тогда 
	//	Запрос = Новый Запрос;
	//	
	//	ТекстГде = "";
	//	Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Артикул) Тогда 
	//		ТекстГде = "И спрНоменклатура.Артикул = &Артикул";
	//		Запрос.УстановитьПараметр("Артикул", ЗагружаемыеЗначенияСтрока.Артикул);
	//	КонецЕсли;
	//	
	//	Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Номенклатура) Тогда 
	//		ТекстГде = ?(ПустаяСтрока(ТекстГде), "И ", ТекстГде + " ИЛИ ") + "спрНоменклатура.Наименование = &Наименование";
	//		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Номенклатура);
	//	КонецЕсли;
	//	
	//	Запрос.Текст = "ВЫБРАТЬ
	//	|	спрНоменклатура.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.Номенклатура КАК спрНоменклатура
	//	|ГДЕ
	//	|	НЕ спрНоменклатура.ЭтоГруппа" + ТекстГде;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл 
	//		СписокНеоднозначностей.Добавить(Выборка.Ссылка);
	//	КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла




#КонецЕсли
